---
kind: property
id: P:Autodesk.Revit.DB.Electrical.WireType.WireMaterial
source: html/2368b8a7-e5bb-cd73-84c5-adfb8dc36239.htm
---
# Autodesk.Revit.DB.Electrical.WireType.WireMaterial Property

The material type of the wire type.

## Syntax (C#)
```csharp
public WireMaterialType WireMaterial { get; set; }
```